namespace bank;
//неизменяемый тип данных, который может содержать только свойства и методы, но не поля. Он используется для представления неизменяемых объектов, таких как транзакции в банковской системе.
/// <summary>
/// Представляет транзакцию на банковском счете, включая сумму, дату и примечание.
/// </summary>
/// <param name="Amount">сумма транзакции</param>
/// <param name="Date">дата транзакции</param>
/// <param name="Note">примечание к транзакции</param>
public record Transaction(decimal Amount, DateTime Date, string Note);